In [ ]:
"""
9. Given  is  a  dataframe  showing  name,  occupation,  salary  of  people. 
Find  the  average salary per occupation
"""
import pandas as  pd
employee =  pd.read_csv("Employee.csv")

print(employee,"\n\n")
#dept_agg = employee.groupby('Occupation').Salary.mean()
#print(dept_agg)
dept_agg = employee.groupby('Occupation').Salary.agg(['count','mean']).reset_index()
print(dept_agg.rename(columns={'count':'Count','mean':'Avg_Salary'}))

    Name Occupation  Salary
0  Naaji   Engineer   52000
1  Aishu     Dancer   60000
2  Kichu     Singer   45000
3   Fida     Dancer   35000
4  Virat   Engineer   75000
5  Kohli  Cricketer   46000


  Occupation  Count  Avg_Salary
0  Cricketer      1     46000.0
1     Dancer      2     47500.0
2   Engineer      2     63500.0
3     Singer      1     45000.0

In [4]:
"""
7.Given a dataframe, change the index of a dataframe from the default indexes to a particular column
"""
import pandas as pd
lists = [[12, 'Virat', 22 ],
         [15, 'Zen', 25],
         [11, 'Aman', 24]]

dataframe = pd.DataFrame(lists, columns = ['id', 'name', 'age'])
print(" original dataframe before custom indexing\n")
print(dataframe)

print("\n\n")
print(" dataframe after custom indexing\n")
dataframe_customindex = dataframe.set_index('id') # custom indexed dataframe with column, 'id'

print(dataframe_customindex)

 original dataframe before custom indexing

   id   name  age
0  12  Virat   22
1  15    Zen   25
2  11   Aman   24



 dataframe after custom indexing

     name  age
id
12  Virat   22
15    Zen   25
11   Aman   24

In [3]:
""""8. Given a dataframe, select first 2 rows and output them"""
import pandas as pd
record = {
  "Name": ["Tom", "Jack", "Lucy",
           "Bob", "Jerry", "Alice",
           "Thomas", "Barbie"],
    
   "Marks": [9, 19, 20, 
             17, 11, 18,
             5, 8], 
    
  "Status": ["Fail", "Pass", "Pass",
             "Pass","Pass", "Pass",
             "Fail", "Fail"]}

df = pd.DataFrame(record)
print(df,"\n")


print("Printing first 3 rows : \n")
df1 = df.head(3)
print(df1,"\n")

print("Printing given number of rows as range : \n")
df2 = df.iloc[2:6]
print(df2,"\n")

print("Printing given number of rows : \n")
df3 = df.iloc[[0, 1, 2]]
print(df3,"\n")

     Name  Marks Status
0     Tom      9   Fail
1    Jack     19   Pass
2    Lucy     20   Pass
3     Bob     17   Pass
4   Jerry     11   Pass
5   Alice     18   Pass
6  Thomas      5   Fail
7  Barbie      8   Fail

Printing first 3 rows :

   Name  Marks Status
0   Tom      9   Fail
1  Jack     19   Pass
2  Lucy     20   Pass

Printing given number of rows as range :

    Name  Marks Status
2   Lucy     20   Pass
3    Bob     17   Pass
4  Jerry     11   Pass
5  Alice     18   Pass

Printing given number of rows :

   Name  Marks Status
0   Tom      9   Fail
1  Jack     19   Pass
2  Lucy     20   Pass

In [ ]:
"""
10.Given a dataframe with NaN Values, fill the NaN values with 0
"""
import pandas as pd
import numpy as np
  
nums = {'Set_of_Numbers': [2, 3, 5, 7, 11, 13,np.nan, 19, 23, np.nan]}

# Create the dataframe
df = pd.DataFrame(nums, columns =['Set_of_Numbers'])
  
# Apply the function
df['Set_of_Numbers'] = df['Set_of_Numbers'].fillna(0)
  
# print the DataFrame
df

   Set_of_Numbers
0             2.0
1             3.0
2             5.0
3             7.0
4            11.0
5            13.0
6             0.0
7            19.0
8            23.0
9             0.0

In [ ]:
"""
11.Given  is  a  dataframe  showing  Company  Names  (cname)  and  corresponding  Profits (profit).  
Convert the  values  of  Profit  column  such that  values  in  it  greater than  0  are set to True 
and the rest are set to False."""

company_data=pd.read_csv('Ex_04_Company.csv')
print(company_data,"\n\n") 

company_data['profit'] = company_data['profit'].apply(lambda x:x>0)
print(company_data)

    cname  profit
0  Nestle       0
1   Apple  690000
2  Adidas   -4500
3    Oppo  -15000
4  Trends   35000


    cname  profit
0  Nestle   False
1   Apple    True
2  Adidas   False
3    Oppo   False
4  Trends    True

In [1]:
"""
12.Given are 2 dataframes, with one dataframe containing Employee ID (eid),
Employee Name (ename) and Stipend (stipend) and the other dataframe containing 
Employee ID (eid) and designation of the employee (designation). 
Output the Dataframe containing Employee   ID   (eid),   Employee   Name   (ename),   
Stipend   (stipend)   and   Position (position)
"""
import pandas as pd

list1=[[12,'Alia',25000],[20,'Deepika',15000],[25,'Sara',10000]]
df_1=pd.DataFrame(list1,columns=['eid','ename','Stipend'])
print(df_1)

print("\n")

list2=[[12,'HR_manager'],[20,'Associate'],[25,'Associate']]
df_2=pd.DataFrame(list2,columns=['eid','Designation'])
print(df_2)

print("\n")
dataframe = pd.merge(df_1, df_2, how = 'inner', on = 'eid') # required dataframe
print(dataframe)

   eid    ename  Stipend
0   12     Alia    25000
1   20  Deepika    15000
2   25     Sara    10000


   eid Designation
0   12  HR_manager
1   20   Associate
2   25   Associate


   eid    ename  Stipend Designation
0   12     Alia    25000  HR_manager
1   20  Deepika    15000   Associate
2   25     Sara    10000   Associate